{"keras_version": "2.2.4", "config": {"layers": [{"config": {"batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "dilation_rate": [1, 1], "filters": 30, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv2d_1", "activation": "relu", "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "kernel_size": [3, 3], "padding": "valid", "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "trainable": true, "name": "max_pooling2d_1", "pool_size": [2, 2], "padding": "valid", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"dilation_rate": [1, 1], "filters": 15, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv2d_2", "activation": "relu", "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "kernel_size": [3, 3], "padding": "valid", "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "trainable": true, "name": "max_pooling2d_2", "pool_size": [2, 2], "padding": "valid", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "dense_1", "activation": "relu", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_constraint": null, "units": 128, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "dense_2", "activation": "relu", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_constraint": null, "units": 50, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "dense_3", "activation": "softmax", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_constraint": null, "units": 10, "bias_regularizer": null}, "class_name": "Dense"}], "name": "sequential_1"}, "backend": "tensorflow", "class_name": "Sequential"}